courseAssist/app/controllers/users_controller.rb

  def create
    #@users = User.create!(user_params)
    #@user = User.find params[:id]
    #flash[:notice] = "#{@user} was successfully created."
    @user  = User.create!(user_params)
---
INSERT INTO "users" ("first", "last", "year", "school", "major", "minor", "uni", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["first", ""], ["last", ""], ["year", 0], ["school", "CC"], ["major", ""], ["minor", nil], ["uni", nil], ["created_at", "2022-11-02 14:20:43.415473"], ["updated_at", "2022-11-02 14:20:43.415473"]]