app/controllers/addcourses_controller.rb

  def create
    @addcourse  = Addcourse.create!(uni: session[:uni],
                                    course: addcourse_params[:course],
                                    semester: addcourse_params[:semester],
                                    year: addcourse_params[:year])
---
INSERT INTO "addcourses" ("uni", "course", "semester", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["uni", "ss6167"], ["course", "Distributed Systems"], ["semester", "Fall"], ["year", 2018], ["created_at", "2022-11-03 02:58:26.757920"], ["updated_at", "2022-11-03 02:58:26.757920"]]