app/controllers/dashboards_controller.rb

SELECT "users".* FROM "users" WHERE "users"."uni" = ? LIMIT ?  [["uni", "ss6167"], ["LIMIT", 1]]
SELECT "addcourses".* FROM "addcourses" WHERE "addcourses"."uni" = ? LIMIT ?  [["uni", "lfc2136"], ["LIMIT", 1]]
---
  def show
    #puts @uni
    #puts "uni above ^^^"
    @uni = session[:uni]
    @user = User.find_by(uni: @uni)
    @classes=Addcourse.find_by(uni: @uni).course # how to get all the courses of someone?